
public class AppConfig {
}

/**Чтобы выполнить задание, следуйте алгоритму:

 Создайте Spring-проект. Добавьте нужные зависимости для работы с бинами, контекстом и аннотациями.
 Создайте абстрактный класс Transport и его наследников Car, Bus, Pickup.

 Создайте класс Driver с полем «транспорт» типа Transport.

 Сконфигурируйте Spring таким образом, чтобы он создал бин для каждого класса-наследника Transport.

 Сразу после создания бинов распечатайте в консоль <тип транспорта> готов к работе.

 Реализуйте из класса Driver Spring-бин так, чтобы в Spring Сontext у вас находилось три бина типа Driver
    (по одному для каждого типа транспорта).

 Распечатайте в удобочитаемом виде в консоли все три Spring-бина типа Driver.
 */